INSERT INTO type(name)
VALUES
('СЫР'), ('МОЛОКО'), ('МОРОЖЕНОЕ'), ('ХЛЕБ');

INSERT INTO product(name, type_id, expired_date, price)
VALUES
('Сыр плавленный', 1, '2023-04-30', 1000),
('Сыр моцарелла', 1, '2023-04-27', 5000),
('Сыр домашний', 1, '2023-06-04', 2000),
('Сыр рикотта', 1, '2023-03-30', 6000),
('Сыр брынза', 1, '2023-02-15', 4000),
('Сыр фета', 1, '2023-07-10', 4500),
('Сыр бри', 1, '2023-08-15', 7000),
('Сыр стилтон', 1, '2023-01-12', 9000),
('Сыр рокфор', 1, '2023-05-16', 10000),
('Сыр кабралес', 1, '2023-05-11', 8300),
('Сыр ливаро', 1, '2023-12-11', 3500),
('Сыр сулугуни', 1, '2023-04-17', 4250),

('Молоко Белый город', 2, '2023-05-12', 90),
('Молоко Parmalat Natura', 2, '2023-05-16', 66),
('Молоко ЭкоНива', 2, '2023-05-14', 78),
('Молоко Домик в деревне', 2, '2023-05-20', 79),

('Мороженое Movenpick', 3, '2023-06-20', 699),
('Мороженое Магнат', 3, '2023-07-12', 80),
('Мороженое Milka', 3, '2023-04-10', 89),
('Мороженое Baskin', 3, '2023-05-17', 480),

('Хлеб белый', 4, '2023-05-10', 40),
('Хлеб рижский', 4, '2023-05-19', 94),
('Хлеб ржано-пшеничный', 4, '2023-05-20', 55),
('Хлеб серый', 4, '2023-05-18', 59);

SELECT *
FROM product